Canonical-Flows/boundaryLayer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0.00 0.00)
    (3 0.00 0.00)
    (3 0.25 0.00)
    (0 0.25 0.00)
    (0 0.00 0.25)
    (3 0.00 0.25)
    (3 0.25 0.25)
    (0 0.25 0.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 100 1) simpleGrading (1 20 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
	
	inlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

	plate
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
	
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
